meliksahaltuntas/NucleoWB55/Projects/NUCLEO_BLE_TEST/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_p2pClient/STM32CubeIDE/Application/User/STM32_WPAN/App/p2p_client_app.c
          /*
           * event data will be of the format
           * 2 bytes handle
           * 2 bytes UUID
           */

          uint8_t index;

          index = 0;
          while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                  (aP2PClientContext[index].connHandle != pr->Connection_Handle))

            index++;

          if(index < BLE_CFG_CLT_MAX_NBR_CB)
          {

            numDesc = (pr->Event_Data_Length) / 4;
            /* we are interested only in 16 bit UUIDs */
            idx = 0;
            if (pr->Format == UUID_TYPE_16)
            {
              for (i=0; i<numDesc; i++)
              {
                handle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_UUID_Pair[idx]);
                uuid = UNPACK_2_BYTE_PARAMETER(&pr->Handle_UUID_Pair[idx+2]);

                if(uuid == CLIENT_CHAR_CONFIG_DESCRIPTOR_UUID)
                {
#if(CFG_DEBUG_APP_TRACE != 0)
                  APP_DBG_MSG("-- GATT : CLIENT_CHAR_CONFIG_DESCRIPTOR_UUID- connection handle 0x%x\n", aP2PClientContext[index].connHandle);
#endif
                  if( aP2PClientContext[index].state == APP_BLE_DISCOVER_NOTIFICATION_CHAR_DESC)
                  {

                    aP2PClientContext[index].P2PNotificationDescHandle = handle;
                    aP2PClientContext[index].state = APP_BLE_ENABLE_NOTIFICATION_DESC;

                  }
                }
                idx += 4;
              }
            }
          }
        }
        break; /*ACI_ATT_FIND_INFO_RESP_VSEVT_CODE*/


        case ACI_GATT_PROC_COMPLETE_VSEVT_CODE:
        {
          aci_gatt_proc_complete_event_rp0 *pr = (void*)blecore_evt->data;
#if(CFG_DEBUG_APP_TRACE != 0)
          APP_DBG_MSG("-- GATT : ACI_GATT_PROC_COMPLETE_VSEVT_CODE \n");
          APP_DBG_MSG("\n");
#endif

          uint8_t index;

          index = 0;
          while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                  (aP2PClientContext[index].connHandle != pr->Connection_Handle))
            index++;

          if(index < BLE_CFG_CLT_MAX_NBR_CB)
          {

            UTIL_SEQ_SetTask( 1<<CFG_TASK_SEARCH_SERVICE_ID, CFG_SCH_PRIO_0);

          }
        }
        break; /*ACI_GATT_PROC_COMPLETE_VSEVT_CODE*/
        default:
          break;
      }
    }

    break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */

    default:
      break;
  }

  return(return_value);
}/* end BLE_CTRL_Event_Acknowledged_Status_t */

void Gatt_Notification(P2P_Client_App_Notification_evt_t *pNotification)
{
/* USER CODE BEGIN Gatt_Notification_1*/

/* USER CODE END Gatt_Notification_1 */
  switch(pNotification->P2P_Client_Evt_Opcode)
  {
/* USER CODE BEGIN P2P_Client_Evt_Opcode */

/* USER CODE END P2P_Client_Evt_Opcode */

    case P2P_NOTIFICATION_INFO_RECEIVED_EVT:
/* USER CODE BEGIN P2P_NOTIFICATION_INFO_RECEIVED_EVT */
    {
      P2P_Client_App_Context.LedControl.Device_Led_Selection=pNotification->DataTransfered.pPayload[0];
      switch(P2P_Client_App_Context.LedControl.Device_Led_Selection) {

        case 0x01 : {

          P2P_Client_App_Context.LedControl.Led1=pNotification->DataTransfered.pPayload[1];

          if(P2P_Client_App_Context.LedControl.Led1==0x00){
            BSP_LED_Off(LED_BLUE);
            APP_DBG_MSG(" -- P2P APPLICATION CLIENT : NOTIFICATION RECEIVED - LED OFF \n\r");
            APP_DBG_MSG(" \n\r");
          } else {
            APP_DBG_MSG(" -- P2P APPLICATION CLIENT : NOTIFICATION RECEIVED - LED ON\n\r");
            APP_DBG_MSG(" \n\r");
            BSP_LED_On(LED_BLUE);
          }

          break;
        }
        default : break;
      }

    }
/* USER CODE END P2P_NOTIFICATION_INFO_RECEIVED_EVT */
      break;

    default:
/* USER CODE BEGIN P2P_Client_Evt_Opcode_Default */

/* USER CODE END P2P_Client_Evt_Opcode_Default */
      break;
  }
/* USER CODE BEGIN Gatt_Notification_2*/

/* USER CODE END Gatt_Notification_2 */
  return;
}

uint8_t P2P_Client_APP_Get_State( void ) {
  return aP2PClientContext[0].state;
}
/* USER CODE BEGIN LF */
/**
 * @brief  Feature Characteristic update
 * @param  pFeatureValue: The address of the new value to be written
 * @retval None
 */

/* Alınan veriyi yazdıran fonksiyon
*
* Bu fonksiyon ne yapar?
* - Client'ın aldığı veriyi detaylı şekilde yazdırır
* - Hex formatında gösterir
* - Checksum hesaplar
* - Server ile karşılaştırma için
*/
static void PrintReceivedData(uint8_t *data, uint16_t length, const char* source) {
   APP_DBG_MSG("\n=== CLIENT VERİ ALDI ===\n");
   APP_DBG_MSG("Kaynak: %s\n", source);
   APP_DBG_MSG("Uzunluk: %d byte\n", length);

   if (length == DATA_STORAGE_SIZE) {  // 30 byte custom data ise
       APP_DBG_MSG("--- CLIENT ALDIĞI VERİ (30 byte) ---\n");

       // Veriyi kopyala (sonra kullanmak için)
       memcpy(ReceivedCustomData, data, DATA_STORAGE_SIZE);

       // Hex formatında yazdır
       for (int i = 0; i < length; i++) {
           if (i % 8 == 0) {
               APP_DBG_MSG("\n[%02d-%02d]: ", i,
                          (i+7 < length) ? i+7 : length-1);
           }
           APP_DBG_MSG("%02X ", data[i]);
       }

       APP_DBG_MSG("\n\n");

       // Checksum hesapla (Server ile karşılaştırmak için)
       uint16_t checksum = 0;
       for (int i = 0; i < length; i++) {
           checksum += data[i];
       }

       APP_DBG_MSG("Client Checksum: 0x%04X (%d decimal)\n", checksum, checksum);
       APP_DBG_MSG("Alma Zamanı: %lu ms\n", HAL_GetTick());

       // ASCII karakter kontrolü (eğer okunabilir karakterler varsa)
       APP_DBG_MSG("ASCII Görünümü: ");
       for (int i = 0; i < length; i++) {
           if (data[i] >= 32 && data[i] <= 126) {  // Printable ASCII aralığı
               APP_DBG_MSG("%c", data[i]);
           } else {
               APP_DBG_MSG(".");  // Okunmayan karakterler için nokta
           }
       }
       APP_DBG_MSG("\n");

       CustomReadCount++;  // İstatistik
       APP_DBG_MSG("Toplam okuma sayısı: %lu\n", CustomReadCount);

   } else {
       // Kısa veri için basit yazdırma
       APP_DBG_MSG("Veri: ");
       for (int i = 0; i < length; i++) {
           APP_DBG_MSG("%02X ", data[i]);
       }
       APP_DBG_MSG("\n");
   }

   APP_DBG_MSG("==========================\n\n");
}

