meliksahaltuntas/NucleoWB55/Projects/NUCLEO_BLE_TEST/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_p2pClient/STM32CubeIDE/Application/User/STM32_WPAN/App/p2p_client_app.c
/*
* Custom veri okuma fonksiyonu
*
* Bu fonksiyon ne yapar?
* - Server'daki 30 byte veriyi okur
* - Handle bilgisini kullanır (debug'dan öğrendiğimiz)
* - GATT read komutu gönderir
*
* ÖNEMLI: Handle değerlerini debug mesajlarından öğrenmelisiniz!
*/
static void ReadCustomData(void) {
    if (P2P_Client_App_Context.ConnectionHandle != 0x00) {

        // Handle'lar keşfedildi mi kontrol et
        if (!CustomHandles.DiscoveryComplete) {
            APP_DBG_MSG("✗ Custom service henüz keşfedilmedi!\n");
            APP_DBG_MSG("  Service discovery başlatılıyor...\n");

            // Service discovery başlat
            aci_gatt_disc_all_primary_services(P2P_Client_App_Context.ConnectionHandle);
            return;
        }

        APP_DBG_MSG("\n>>> CLIENT CUSTOM VERİYİ OKUYOR <<<\n");

        // Artık doğru handle'ı kullan
        tBleStatus ret = aci_gatt_read_char_value(
            P2P_Client_App_Context.ConnectionHandle,
            CustomHandles.StorageCharHandle  // Dinamik handle kullan
        );

        if (ret == BLE_STATUS_SUCCESS) {
            APP_DBG_MSG("✓ Read komutu gönderildi, Handle: 0x%04X\n",
                       CustomHandles.StorageCharHandle);
        } else {
            APP_DBG_MSG("✗ Read hatası: 0x%x\n", ret);
        }
    }
}

/*
* Clear komutu gönderme fonksiyonu
*
* Bu fonksiyon ne yapar?
* - Server'a [0xDE, 0xAD] komutunu gönderir
* - "Veriyi okudum, yenisini üretebilirsin" anlamında
* - Server yeni veri üretir
*/
/*static void SendClearCommand(void) {
    if (P2P_Client_App_Context.ConnectionHandle != 0x00) {

        // Handle'lar hazır mı kontrol et
        if (!CustomHandles.DiscoveryComplete) {
            APP_DBG_MSG("✗ Custom service henüz keşfedilmedi!\n");
            return;
        }

        APP_DBG_MSG("\n>>> CLIENT CLEAR KOMUTU GÖNDERİYOR <<<\n");

        uint8_t clear_command[COMMAND_SIZE] = {
            CMD_CLEAR_DATA_BYTE1,  // 0xDE
            CMD_CLEAR_DATA_BYTE2   // 0xAD
        };

        // Doğru handle ile komut gönder
        tBleStatus ret = aci_gatt_write_char_value(
            P2P_Client_App_Context.ConnectionHandle,
            CustomHandles.CommandCharHandle,  // Dinamik handle
            COMMAND_SIZE,
            clear_command
        );

        if (ret == BLE_STATUS_SUCCESS) {
               CustomWriteCount++;  // Sayacı artır
               APP_DBG_MSG("✓ Clear komutu gönderildi, Handle: 0x%04X\n",
                          CustomHandles.CommandCharHandle);
               APP_DBG_MSG("Toplam yazma sayısı: %lu\n", CustomWriteCount);  // Sayacı göster
           }
    }
}
*/

/*
* Komple test fonksiyonu
*
* Bu fonksiyon ne yapar?
* 1. Önce veriyi okur
* 2. 2 saniye bekler
* 3. Clear komutu gönderir
* 4. 2 saniye bekler
* 5. Yeni veriyi okur
*/
static void TestCustomService(void) {
   APP_DBG_MSG("\n========== CUSTOM SERVICE TEST BAŞLIYOR ==========\n");

   // 1. Mevcut veriyi oku
   APP_DBG_MSG("ADIM 1: Mevcut veri okunuyor...\n");
   ReadCustomData();

   // 2. Kısa bekleme (Server'ın cevap vermesi için)
   HAL_Delay(2000);  // 2 saniye bekle

   // 3. Clear komutu gönder
   APP_DBG_MSG("ADIM 2: Clear komutu gönderiliyor...\n");
   SendClearCommand();

   // 4. Server'ın yeni veri üretmesi için bekle
   HAL_Delay(2000);  // 2 saniye bekle

   // 5. Yeni veriyi oku
   APP_DBG_MSG("ADIM 3: Yeni veri okunuyor...\n");
   ReadCustomData();

   APP_DBG_MSG("========== CUSTOM SERVICE TEST BİTTİ ==========\n\n");
}
static void AutoDisconnect_Timer_Callback(void) {
    // 2 saniye sonra çağrılacak fonksiyon
    APP_DBG_MSG("-- 2 SANIYE GECTI - BAGLANTI KESILIYOR --\n");

    if (P2P_Client_App_Context.ConnectionHandle != 0x00) {
        // Bağlantıyı kes
        aci_gap_terminate(P2P_Client_App_Context.ConnectionHandle,
                         HCI_REMOTE_USER_TERMINATED_CONNECTION_ERR_CODE);

        AutoDisconnectEnabled = 0; // Otomatik disconnect'i durdur
        APP_DBG_MSG("-- DISCONNECT KOMUTU GÖNDERİLDİ --\n");
        UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_0);
    }
}

// Clienttan servera veri göndermek için kullanılır
tBleStatus Write_Char(uint16_t UUID, uint8_t Service_Instance, uint8_t *pPayload)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  uint8_t index;

  index = 0;
  while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
          (aP2PClientContext[index].state != APP_BLE_IDLE))
  {
    switch(UUID)
    {
      case P2P_WRITE_CHAR_UUID: /* SERVER RX -- so CLIENT TX */
        ret = aci_gatt_write_without_resp(aP2PClientContext[index].connHandle,
                                         aP2PClientContext[index].P2PWriteToServerCharHdle,
                                         2, /* charValueLen */
                                         (uint8_t *)  pPayload);
        break;
      default:
        break;
    }
    index++;
  }

  return ret;
}/* end Write_Char() */

void Button_Trigger_Received(void)
{
    APP_DBG_MSG("-- BUTON BASILDI --\n");

    // P2P button işlevi
    if(P2P_Client_App_Context.ButtonStatus.Button1 == 0x00) {
        P2P_Client_App_Context.ButtonStatus.Button1 = 0x01;
    } else {
        P2P_Client_App_Context.ButtonStatus.Button1 = 0x00;
    }

    Write_Char(P2P_WRITE_CHAR_UUID, 0, (uint8_t *)&P2P_Client_App_Context.ButtonStatus);

    // Custom service test - sadece veri okuma
    APP_DBG_MSG("Custom service test: Veri okuma\n");
    ReadCustomData();  // Sadece okuma testi
}
void Update_Service()
{
  uint16_t enable = 0x0001;
  uint16_t disable = 0x0000;
  uint8_t index;

  index = 0;
  while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
          (aP2PClientContext[index].state != APP_BLE_IDLE))
  {
    switch(aP2PClientContext[index].state)
    {
      case APP_BLE_DISCOVER_SERVICES:
        APP_DBG_MSG("P2P_DISCOVER_SERVICES\n");
        break;
      case APP_BLE_DISCOVER_CHARACS:
        APP_DBG_MSG("* GATT : Discover P2P Characteristics\n");
        aci_gatt_disc_all_char_of_service(aP2PClientContext[index].connHandle,
                                          aP2PClientContext[index].P2PServiceHandle,
                                          aP2PClientContext[index].P2PServiceEndHandle);
        break;
      case APP_BLE_DISCOVER_WRITE_DESC: /* Not Used - No descriptor */
        APP_DBG_MSG("* GATT : Discover Descriptor of TX - Write  Characteristic\n");
        aci_gatt_disc_all_char_desc(aP2PClientContext[index].connHandle,
                                    aP2PClientContext[index].P2PWriteToServerCharHdle,
                                    aP2PClientContext[index].P2PWriteToServerCharHdle+2);
        break;
      case APP_BLE_DISCOVER_NOTIFICATION_CHAR_DESC:
        APP_DBG_MSG("* GATT : Discover Descriptor of Rx - Notification  Characteristic\n");
        aci_gatt_disc_all_char_desc(aP2PClientContext[index].connHandle,
                                    aP2PClientContext[index].P2PNotificationCharHdle,
                                    aP2PClientContext[index].P2PNotificationCharHdle+2);
        break;
      case APP_BLE_ENABLE_NOTIFICATION_DESC:
        APP_DBG_MSG("* GATT : Enable Server Notification\n");
        aci_gatt_write_char_desc(aP2PClientContext[index].connHandle,
                                 aP2PClientContext[index].P2PNotificationDescHandle,
                                 2,
                                 (uint8_t *)&enable);
        aP2PClientContext[index].state = APP_BLE_CONNECTED_CLIENT;
        BSP_LED_Off(LED_RED);
        break;
      case APP_BLE_DISABLE_NOTIFICATION_DESC :
        APP_DBG_MSG("* GATT : Disable Server Notification\n");
        aci_gatt_write_char_desc(aP2PClientContext[index].connHandle,
                                 aP2PClientContext[index].P2PNotificationDescHandle,
                                 2,
                                 (uint8_t *)&disable);
        aP2PClientContext[index].state = APP_BLE_CONNECTED_CLIENT;
        break;
      default:
        break;
    }
    index++;
  }
  return;
}
/* USER CODE END LF */
